In [1]:
#######. MERGE ########

In [13]:
import pandas as pd

var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,22,33,44]})
var2 = pd.DataFrame({"A":[1,2,3,4],"C":[10,20,30,40]})
pd.merge(var1,var2)

   A   B   C
0  1  11  10
1  2  22  20
2  3  33  30

In [7]:
pd.merge(var1,var2,on="A")

   A   B   C
0  1  11  10
1  2  22  20
2  3  33  30
3  4  44  40

In [8]:
pd.merge(var1,var2 ,how = "left") #left ==var1,   right=var2

   A   B   C
0  1  11  10
1  2  22  20
2  3  33  30
3  4  44  40

In [9]:
pd.merge(var1,var2 ,how = "right") #left ==var1,   right=var2

   A   B   C
0  1  11  10
1  2  22  20
2  3  33  30
3  4  44  40

In [14]:
pd.merge(var1,var2 ,how = "outer")

   A     B     C
0  1  11.0  10.0
1  2  22.0  20.0
2  3  33.0  30.0
3  4  44.0   NaN
4  5   NaN  40.0

In [15]:
pd.merge(var1,var2 ,how = "outer",indicator = True) #value change 4=5

   A     B     C      _merge
0  1  11.0  10.0        both
1  2  22.0  20.0        both
2  3  33.0  30.0        both
3  4  44.0   NaN   left_only
4  5   NaN  40.0  right_only

In [16]:
#suffixes change the name(columns)

In [17]:
#Concat

In [19]:
s1=pd.Series([1,2,3,4])
s2=pd.Series([11,22,33,44])
pd.concat([s1,s2])

0     1
1     2
2     3
3     4
0    11
1    22
2    33
3    44
dtype: int64

In [22]:
d1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,22,33,44]})
d2 = pd.DataFrame({"A":[1,2,3,5],"C":[10,20,30,40]})
pd.concat([d1,d2],axis=1)#columns merge

   A   B  A   C
0  1  11  1  10
1  2  22  2  20
2  3  33  3  30
3  4  44  5  40

In [25]:
d1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,22,33,44]})
d2 = pd.DataFrame({"A":[1,2,3,4],"C":[10,20,30,40]})
pd.concat([d1,d2],axis=1)#columns merge

   A   B  A   C
0  1  11  1  10
1  2  22  2  20
2  3  33  3  30
3  4  44  4  40

In [24]:
pd.concat([d1,d2],axis=1,join="inner")#columns merge

   A   B  A   C
0  1  11  1  10
1  2  22  2  20

In [27]:
pd.concat([d1,d2],axis=1,keys=["d1","d2"])#columns merge

  d1     d2
   A   B  A   C
0  1  11  1  10
1  2  22  2  20
2  3  33  3  30
3  4  44  4  40